In [1]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

In [5]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [7]:
df = pd.DataFrame(d)

df

Excluindo a linha dos valores faltantes

In [11]:
df.dropna()

     A    B  C
0  1.0  5.0  1

Exclui as linhas quais tem no minimo 2 dados faltantes

In [16]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [21]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Para realmente fazer alteracoes no DataSet tem q colocar "inplace=True"

Metodo que altera os dados ausentes por algum dado

In [25]:
df.fillna(value='Fill na')

         A        B  C
0      1.0      5.0  1
1      2.0  Fill na  2
2  Fill na  Fill na  3

Pega o valor eusente da coluna A e subsititui pela media entre os outro valores da coluna

In [27]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [30]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Substitui os valores ausentes por valores anteiriores

In [34]:
df.fillna(method='ffill')

C:\Users\thier\AppData\Local\Temp\ipykernel_23500\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3